#+TITLE: Emacs Configuration
#+AUTHOR: Christian Guetnga
#+EMAIL: lsdrfrx@gmail.com

This is my brand new emacs configuration

** Appearance
#+BEGIN_SRC emacs-lisp
  (custom-theme-set-faces
    'user
    '(fixed-pitch ((t ( :family "Fira Code Nerd Font Mono" :height 130)))))

   (custom-theme-set-faces
     'user
     '(org-block ((t (:inherit fixed-pitch))))
     '(org-code ((t (:inherit (shadow fixed-pitch)))))
     '(org-document-info ((t (:foreground "dark orange"))))
     '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
     '(org-indent ((t (:inherit (org-hide fixed-pitch)))))
     '(org-link ((t (:foreground "royal blue" :underline t))))
     '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
     '(org-property-value ((t (:inherit fixed-pitch))) t)
     '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
     '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
     '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
     '(org-verbatim ((t (:inherit (shadow fixed-pitch))))))

  (use-package org-modern
    :ensure t
    :config
    (setq org-modern-star "replace")
    (setq org-modern-replace-stars "󰪥")
    (global-org-modern-mode))

    (setq org-ellipsis "↴")
#+END_SRC

#+RESULTS:
: ↴

** Neotree
#+BEGIN_SRC emacs-lisp
  (use-package neotree
    :ensure t
    :hook
    (neotree-mode . (lambda () (setq mode-line-format nil))))

#+END_SRC

#+RESULTS:
| lambda | nil | (setq mode-line-format nil) |

* Keybindings
#+BEGIN_SRC emacs-lisp
  (evil-set-leader 'normal (kbd "SPC"))

  (define-key evil-motion-state-map (kbd "RET") nil)
  (define-key evil-motion-state-map (kbd "K") nil)
  (keymap-global-set "C-SPC" 'company-capf)
  (keymap-global-set "M-TAB" 'other-window)

  (evil-global-set-key 'normal (kbd "<leader>e") 'neotree-toggle)
  (evil-global-set-key 'normal (kbd "K") 'lsp-ui-doc-glance)
  (evil-global-set-key 'normal (kbd "<leader>DEL") (lambda ()
    (interactive)
    (save-buffer)
    (kill-current-buffer)))

  (define-key company-active-map
              (kbd "<tab>")
              (lambda ()
                (interactive)
                (company-complete-common-or-cycle)))
  (define-key company-active-map
              (kbd "<backtab>")
              (lambda ()
                (interactive)
                (company-complete-common-or-cycle -1)))
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (company-complete-common-or-cycle -1) |
